/*
*********************************************************************************************************
*
*	模块名称 : stm32_t2定时器驱动
*	文件名称 : user_cnc_stm32_t2.c
*	版    本 : V1.1
*	说    明 : stm32_t2的定时器驱动
*
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    2016-12-15  lcj      开写
*  V1.1    2017-06-30  lcj      添加每个轴的速度限制，在cnc_conf.h中增加高低速宏定义  CNC_MAX_XV ...
*                                                     在move_typedef中增加min_speed 和max_speed
*                               更改cnc_motor_conf为cnc_motor_init
*                               更改cnc_conf为cnc_statr_conf 和 cnc_parameter_conf
*
*	Copyright (C), 2016-2017, lcj1031@foxmail.com
*
*********************************************************************************************************
*/
#include "cnc.h"
#include "bsp.h"

void stm32_t2_init(uint32_t arr);
void stm32_t2_open(void);
void stm32_t2_close(void);
void stm32_t2_updata(uint32_t arr);

cnc_tim_api_typedef stm32_tim2=
{
	stm32_t2_init,
	stm32_t2_open,
	stm32_t2_close,
	stm32_t2_updata,
};

/*
*********************************************************************************************************
*	函 数 名: stm32_t2_init
*	功能说明: stm32定时器2的初始化
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void stm32_t2_init(uint32_t arr)
{
/*******************************标准库*******************************/
//	TIM2_init(arr);
 //TIM2->CR1|=(1<<7);
 TIM2->CCR1=(arr>>1);
 TIM2->ARR=arr; 
 TIM2->PSC=CNC_TIM_PSC;
 TIM2->SR=0x0000;
 TIM2->CNT=0x0000;
/*******************************HAL库*******************************/
}	

/*
*********************************************************************************************************
*	函 数 名: stm32_t2_open
*	功能说明: 开stm32定时器2
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void stm32_t2_open(void)
{
	CNC_XENL;CNC_YENL;CNC_ZENL;CNC_AENL;
	CNC_XCPH;CNC_YCPH;
/*******************************标准库*******************************/
// TIM_Cmd(TIM2, ENABLE);
// TIM_ITConfig(TIM2,TIM_IT_CC1, ENABLE );
// TIM_ITConfig(TIM2,TIM_IT_Update , ENABLE );
// TIM2->SR=0x0000;
/*******************************HAL库*******************************/
 TIM2->SR=0x0000;
 TIM2->DIER=0x0003;
 TIM2->CR1=0x0001;
// HAL_TIM_Base_Start_IT(&htim2);
// HAL_TIM_OC_Start_IT(&htim2,TIM_CHANNEL_1);
}

/*
*********************************************************************************************************
*	函 数 名: stm32_t2_close
*	功能说明: 关stm32定时器2
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void stm32_t2_close(void)
{
	CNC_XENH;CNC_YENH;CNC_ZENH;CNC_AENH;
	CNC_XCPH;CNC_YCPH;
/*******************************标准库*******************************/
// TIM_Cmd(TIM2, DISABLE);
// TIM_ITConfig(TIM2,TIM_IT_CC1,DISABLE);
// TIM_ITConfig(TIM2,TIM_IT_Update ,DISABLE);
// TIM2->SR=0x0000; 
/*******************************HAL库*******************************/
	TIM2->SR=0x0000;
 TIM2->DIER=0x0000;
 TIM2->CR1=0x0000;
//	HAL_TIM_Base_Stop_IT(&htim2);
//	HAL_TIM_OC_Stop_IT(&htim2,TIM_CHANNEL_1);
}

/*
*********************************************************************************************************
*	函 数 名: stm32_t2_updata
*	功能说明: 更新定时器值
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void stm32_t2_updata(uint32_t arr)
{
/*******************************标准库*******************************/
	TIM2->CCR1=(arr>>1);
 TIM2->ARR=arr;
/*******************************HAL库*******************************/
}	

/***************************** lcj1031@foxmail.com (END OF FILE) *********************************/
